wisteria-1c/Конфигурация/InformationRegisters/ЦеныНоменклатуры.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<InformationRegister>
		<Properties>
			<Name>ЦеныНоменклатуры</Name>
			<InformationRegisterPeriodicity>Second</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Цена</Name>
					<Comment>Цена</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Актуальность</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ЕдиницаИзмерения</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.КлассификаторЕдиницИзмерения</v8:Type>
						<v8:Type>cfg:CatalogRef.ЕдиницыИзмерения</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ВалютаЦены</Name>
					<Comment>Валюта цены</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>ВключаяХарактеристики</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Автор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДокументУстановки</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.РасходнаяНакладная</v8:Type>
						<v8:Type>cfg:DocumentRef.ОтчетКомиссионера</v8:Type>
						<v8:Type>cfg:DocumentRef.ПриходнаяНакладная</v8:Type>
						<v8:Type>cfg:DocumentRef.УстановкаЦенНоменклатуры</v8:Type>
						<v8:Type>cfg:DocumentRef.АктВыполненныхРабот</v8:Type>
						<v8:Type>cfg:DocumentRef.АвансовыйОтчет</v8:Type>
						<v8:Type>cfg:DocumentRef.ЗаказПокупателя</v8:Type>
						<v8:Type>cfg:DocumentRef.КорректировкаПоступления</v8:Type>
						<v8:Type>cfg:DocumentRef.СчетНаОплату</v8:Type>
						<v8:Type>cfg:DocumentRef.РасходыПредпринимателя</v8:Type>
						<v8:Type>cfg:DocumentRef.ОтчетОРозничныхПродажах</v8:Type>
						<v8:Type>cfg:DocumentRef.ЗаказПоставщику</v8:Type>
						<v8:Type>cfg:DocumentRef.СчетНаОплатуПоставщика</v8:Type>
						<v8:Type>cfg:DocumentRef.ДополнительныеРасходы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>ВидЦен</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВидыЦен</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Номенклатура</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Характеристика</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ХарактеристикиНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

wisteria-1c/Конфигурация/Enums/ТипыНоменклатуры.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Enum>
		<Properties>
			<Name>ТипыНоменклатуры</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Запас</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Услуга</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Работа</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Операция</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВидРабот</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПодарочныйСертификат</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

wisteria-1c/Конфигурация/Enums/СпособыРасчетаЦеныНабора.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Enum>
		<Properties>
			<Name>СпособыРасчетаЦеныНабора</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>СкладыватьИзЦенКомплектующих</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НазначаетсяИРаспределяетсяПоЦене</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НазначаетсяИРаспределяетсяПоДолеСтоимости</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

wisteria-1c/Конфигурация/InformationRegisters/ЦеныНоменклатуры/Forms/ЦеныНоменклатуры/Ext/Form/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	// Установка доступности цен для редактирования.
	Элементы.Список.ТолькоПросмотр = Не ПравоДоступа("Изменение", Метаданные.РегистрыСведений.ЦеныНоменклатуры);

	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "ФормаДиаграмма", "Пометка", Истина);

	ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(Список, "Номенклатура",
		Параметры.Отбор.Номенклатура, ВидСравненияКомпоновкиДанных.Равно, "Номенклатура", Истина); 
		
	ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(СписокИстория, "Номенклатура",
		Параметры.Отбор.Номенклатура, ВидСравненияКомпоновкиДанных.Равно, "Номенклатура", Истина);

	Если Параметры.Отбор.Номенклатура.ТипНоменклатуры = Перечисления.ТипыНоменклатуры.ПодарочныйСертификат Тогда
		АвтоЗаголовок = Ложь;
		Заголовок = НСтр("ru = 'Цены не хранятся для подарочных сертификатов'");
		Элементы.Список.ТолькоПросмотр = Истина;
		Элементы.СписокИстория.ТолькоПросмотр = Истина;
	КонецЕсли;

	ПрочитатьИУстановитьНастройкиФормы();
	
	фоИспользоватьУстановкуЦен = ПолучитьФункциональнуюОпцию("ИспользоватьУстановкуЦен");
	
	Если НЕ фоИспользоватьУстановкуЦен Тогда
		
		ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "ГруппаУстановкаЦен", "Видимость", Ложь);

	КонецЕсли;
	
	ВывестиВажныеСообщенияБаннеры();
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	// Наборы
	Если ТипЗнч(ВладелецФормы) = Тип("ФормаКлиентскогоПриложения") И ВладелецФормы.ИмяФормы
		= "Справочник.Номенклатура.Форма.ФормаЭлемента" Тогда

		ОбъектНоменклатура = ВладелецФормы.Объект;

		Если ОбъектНоменклатура.ЭтоНабор И ОбъектНоменклатура.СпособРасчетаЦеныНабора = ПредопределенноеЗначение(
			"Перечисление.СпособыРасчетаЦеныНабора.СкладыватьИзЦенКомплектующих") Тогда

			АвтоЗаголовок = Ложь;
			Заголовок = НСтр("ru = 'Цены недоступны для наборов со способом расчета цен по комплектующим'");
			Элементы.Список.ТолькоПросмотр = Истина;

		КонецЕсли;

	КонецЕсли; 	
	// Конец Наборы

КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	
	Если ИмяСобытия = "ОбновитьСписокЦенНоменклатуры" Тогда
		
		Элементы.Список.Обновить();
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы


#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыСписок

&НаКлиенте
Процедура СписокПриАктивизацииСтроки(Элемент)
	
	ПодключитьОбработчикОжидания("ИнициироватьЗаполнениеДиаграммы", 0.2, Истина);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура Диаграмма(Команда)

	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "ФормаДиаграмма", "Пометка",
		Не Элементы.ФормаДиаграмма.Пометка);
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "ДинамикаИзмененияЦены", "Видимость",
		Элементы.ФормаДиаграмма.Пометка);

КонецПроцедуры

&НаКлиенте
Процедура Хронология(Команда)
	
	СоответствиеСтраниц = Новый Соответствие;
	СоответствиеСтраниц.Вставить(Элементы.СтраницаСписок, Элементы.СтраницаСписокИстория);
	СоответствиеСтраниц.Вставить(Элементы.СтраницаСписокИстория, Элементы.СтраницаСписок);
	
	Элементы.Страницы.ТекущаяСтраница = СоответствиеСтраниц.Получить(Элементы.Страницы.ТекущаяСтраница);
	
	Если Элементы.Страницы.ТекущаяСтраница.Имя = "СтраницаСписокИстория" Тогда
		Элементы.СписокИсторияХронология.Заголовок = НСтр("ru = 'Хронология'");	
	ИначеЕсли Элементы.Страницы.ТекущаяСтраница.Имя = "СтраницаСписок" Тогда
		Элементы.СписокИсторияХронология.Заголовок = НСтр("ru = 'История изменений'");	
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ВывестиВажныеСообщенияБаннеры()
		
	ПараметрыСообщения = ОбщегоНазначения.ПараметрыВажногоСообщения();
	ПараметрыСообщения.ТипСообщения			= "Информация";
	ПараметрыСообщения.Скрываемый			= Истина;  
	ПараметрыСообщения.Заголовок			= НСтр("ru = 'Варианты установки цен:'");
	
	Сообщение = СтроковыеФункции.ФорматированнаяСтрока(НСтр("ru = 'Для установки новой цены номенклатуры можно использовать кнопку списка <b>""Создать""</b>, либо перейти к документам <b>""Установки цен""</b>.'"));  
	
	ПараметрыСообщения.Сообщение			= Сообщение; 
	ПараметрыСообщения.КраткоеПредставление	= НСтр("ru = 'Варианты установки цен'");
	ПараметрыСообщения.Идентификатор 		= "ВариантыУстановкиЦен"; 
	ПараметрыСообщения.ОбработчикЗакрытия	= "Подключаемый_ОбработчикЗакрытияОсновнойБанерФормы";
	
	Действие1 = ОбщегоНазначения.ПараметрыДействияВажногоСообщения();
	Действие1.ИмяКоманды	= "ПерейтиКДокументамУстановкаЦен";
	Действие1.Заголовок	= НСтр("ru = 'Перейти к документам ""Установка цен""'");
	Действие1.Обработчик	= "Подключаемый_ПерейтиКДокументУстановкаЦен";  
	
	МассивДействий = Новый Массив;   
	МассивДействий.Добавить(Действие1);
	
	ПараметрыСообщения.ПараметрыДействия = МассивДействий;
	
	ОбщегоНазначения.ВставитьВажноеСообщение(ЭтотОбъект, ПараметрыСообщения, "ГруппаПанельИнформации");
	ОбщегоНазначения.ВывестиСтатусыИВажныеСообщенияНаФорму(ЭтотОбъект);
	
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ПерейтиКДокументУстановкаЦен()
		
	ОткрытьФорму("Документ.УстановкаЦенНоменклатуры.ФормаСписка");
	
КонецПроцедуры 

&НаКлиенте
Процедура Подключаемый_ОбработчикЗакрытияОсновнойБанерФормы()

	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "ГруппаПанельИнформации", 
			"Видимость", Ложь);
	
КонецПроцедуры 

&НаСервере
Процедура ОбновитьДиаграммуНаСервере(ДанныеТекущейСтроки)
	
	НациональнаяВалюта = Константы.НациональнаяВалюта.Получить();
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ ПЕРВЫЕ 10
	|	ЦеныНоменклатуры.Период КАК Период,
	|	ЦеныНоменклатуры.Цена КАК Цена,
	|	ВЫБОР КОГДА ЦеныНоменклатуры.ВалютаЦены <> ЗНАЧЕНИЕ(Справочник.Валюты.ПустаяСсылка)
	|		ТОГДА ЦеныНоменклатуры.ВалютаЦены
	|		ИНАЧЕ ЦеныНоменклатуры.ВидЦен.ВалютаЦены
	|	КОНЕЦ КАК ВалютаЦены
	|ПОМЕСТИТЬ ЦеныНоменклатуры
	|ИЗ
	|	РегистрСведений.ЦеныНоменклатуры КАК ЦеныНоменклатуры
	|ГДЕ
	|	ЦеныНоменклатуры.Номенклатура = &Номенклатура
	|	И ЦеныНоменклатуры.Характеристика = &Характеристика
	|	И ЦеныНоменклатуры.ВидЦен = &ВидЦен
	|	И ЦеныНоменклатуры.ЕдиницаИзмерения = &ЕдиницаИзмерения
	|
	|УПОРЯДОЧИТЬ ПО
	|	Период УБЫВ
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ЦеныНоменклатуры.Период КАК Период,
	|	ЦеныНоменклатуры.Цена,
	|	ЦеныНоменклатуры.ВалютаЦены
	|ИЗ
	|	ЦеныНоменклатуры КАК ЦеныНоменклатуры
	|
	|УПОРЯДОЧИТЬ ПО
	|	Период";
	
	Запрос.УстановитьПараметр("Номенклатура",		ДанныеТекущейСтроки.Номенклатура);
	Запрос.УстановитьПараметр("ВидЦен", 			ДанныеТекущейСтроки.ВидЦен);
	
	Если ДанныеТекущейСтроки.Свойство("Характеристика") Тогда
		
		Запрос.УстановитьПараметр("Характеристика",	ДанныеТекущейСтроки.Характеристика);
		
	Иначе
		
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "И ЦеныНоменклатуры.Характеристика = &Характеристика", "");
		
	КонецЕсли;
	
	Если ДанныеТекущейСтроки.Свойство("ЕдиницаИзмерения") Тогда
		
		Запрос.УстановитьПараметр("ЕдиницаИзмерения", ДанныеТекущейСтроки.ЕдиницаИзмерения);
		
	Иначе
		
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "И ЦеныНоменклатуры.ЕдиницаИзмерения = &ЕдиницаИзмерения", "");
		
	КонецЕсли;
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	ДинамикаИзмененияЦены.Очистить();
	ДинамикаИзмененияЦены.Обновление = Ложь;
	ДинамикаИзмененияЦены.ВидПодписей = ВидПодписейКДиаграмме.Значение;
	
	Серия = ДинамикаИзмененияЦены.Серии.Добавить("История цены");
	Пока Выборка.Следующий() Цикл
		
		Если Выборка.Количество() = 1 Тогда
			
			ФорматДатыГрафика		= Формат(Выборка.Период, "");
			ЦенаСтрокой			= Строка("0");
			НоваяТочка 			= ДинамикаИзмененияЦены.Точки.Добавить(Строка(ФорматДатыГрафика));
			ДинамикаИзмененияЦены.УстановитьЗначение(НоваяТочка, Серия, 0, , ЦенаСтрокой);
			
		КонецЕсли;
		
		Цена = Выборка.Цена;
		Если Выборка.ВалютаЦены <> НациональнаяВалюта Тогда
			Цена = РаботаСКурсамиВалют.ПересчитатьВВалюту(Выборка.Цена, Выборка.ВалютаЦены, НациональнаяВалюта,
				ТекущаяДатаСеанса());
		КонецЕсли;
		
		ФорматДатыГрафика		= Формат(Выборка.Период, "");
		ЦенаСтрокой			= Строка(Формат(Цена, "ЧЦ=15; ЧДЦ=2; ЧРГ="));
		НоваяТочка 			= ДинамикаИзмененияЦены.Точки.Добавить(Строка(ФорматДатыГрафика));
		ДинамикаИзмененияЦены.УстановитьЗначение(НоваяТочка, Серия, Цена, , ЦенаСтрокой);
		
	КонецЦикла;
	
	ДинамикаИзмененияЦены.Обновление = Истина;
	
КонецПроцедуры

&НаКлиенте
Процедура ИнициироватьЗаполнениеДиаграммы()
	
	Если Элементы.ФормаДиаграмма.Пометка Тогда
		
		ДанныеСтроки = Элементы.Список.ТекущиеДанные;
		Если ДанныеСтроки <> Неопределено Тогда
			
			ДанныеТекущейСтроки = Новый Структура("Номенклатура, ВидЦен", ДанныеСтроки.Номенклатура, ДанныеСтроки.ВидЦен);
			Если ДанныеСтроки.Свойство("Характеристика") Тогда
				
				ДанныеТекущейСтроки.Вставить("Характеристика", ДанныеСтроки.Характеристика);
				
			КонецЕсли;
			
			Если ДанныеСтроки.Свойство("ЕдиницаИзмерения") Тогда
				
				ДанныеТекущейСтроки.Вставить("ЕдиницаИзмерения", ДанныеСтроки.ЕдиницаИзмерения);
				
			КонецЕсли;
			
			ОбновитьДиаграммуНаСервере(ДанныеТекущейСтроки);
			
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры


&НаСервере
Процедура ПрочитатьИУстановитьНастройкиФормы()
	
	КлючОбъекта			= ИмяФормы + "/НастройкиФормы";
	КлючНастройки = "ОтображатьПанельИнформации";
	ТекущиеНастройки 	= ХранилищеСистемныхНастроек.Загрузить(КлючОбъекта, КлючНастройки);
	
	Если ТекущиеНастройки <> Неопределено 
		И ТипЗнч(ТекущиеНастройки) = Тип("ХранилищеЗначения") Тогда
		
		Элементы.ГруппаПанельИнформации.Видимость = ТекущиеНастройки.Получить().Видимость;
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти
